**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
Определите какому фильму было выставлено больше всего оценок 5.0

In [7]:
import pandas as pd

In [28]:
#Чтение таблицы "rating.csv"
rating = pd.read_csv ('ratings.csv')
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [37]:
#Чтение таблицы "movies.csv"
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [38]:
#Соединение двух таблиц по "movieid"
joined = rating.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [41]:
#Фильтрация фильмов с оценками "5"
filtred_joined = joined[joined.rating == 5.0]
filtred_joined.head()

,userId,movieId,rating,timestamp,title,genres
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
6,1,101,5.0,964980868,Bottle Rocket (1996),Adventure|Comedy|Crime|Romance
8,1,151,5.0,964984041,Rob Roy (1995),Action|Drama|Romance|War
9,1,157,5.0,964984100,Canadian Bacon (1995),Comedy|War

In [45]:
#Поиск фильма с максимальным количеством оценок "5"
filtred_joined['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    153
Name: title, dtype: int64

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [47]:
#Чтение файла
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [50]:
#Поиск стран по названию
power[ power['country'].str.contains('lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [51]:
power[ power['country'].str.contains('lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [52]:
power[ power['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [78]:
# Фильтры по условиям
filtred_countries = power[((power['country']=='Latvia') | (data['country']=='Lithuania') | (data['country']=='Estonia')) & \
                           ((power['category']==4) | (power['category']==12) | (power['category']==21)) \
                           & (power['quantity'] >0) & ((power['year']>=2005) & (power['year'] <= 2010))]
filtred_countries.head(200)

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
219768  Lithuania  2008      54.0        21
219769  Lithuania  2007      47.0        21
219770  Lithuania  2006      31.0        21
219771  Lithuania  2005       1.0        21
221412    Estonia  2010      21.0        21

[200 rows x 4 columns]

In [81]:
#Сумма
sum_power = filtred_countries['quantity'].sum()
print(sum_power)

240580.0

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти): 
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [91]:
values_ = pd.read_html('https://cbr.ru/currency_base/daily/')[0]
values_.head()

   Цифр. код Букв. код  Единиц                 Валюта    Курс
0         36       AUD       1   Австралийский доллар  424165
1        944       AZN       1  Азербайджанский манат  370350
2         51       AMD     100       Армянских драмов  131306
3        933       BYN       1      Белорусский рубль  295004
4        975       BGN       1         Болгарский лев  353931